saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Atmel.SAM3S_DFP.1.0.70.pdsc
      <condition id="ATSAM3S1B">
         <require Dvendor="Atmel:3" Dname="ATSAM3S1B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM3S1C">
         <require Dvendor="Atmel:3" Dname="ATSAM3S1C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM3S8C">
         <require Dvendor="Atmel:3" Dname="ATSAM3S8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM3S8B">
         <require Dvendor="Atmel:3" Dname="ATSAM3S8B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM3SD8B">
         <require Dvendor="Atmel:3" Dname="ATSAM3SD8B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM3SD8C">
         <require Dvendor="Atmel:3" Dname="ATSAM3SD8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S2A">
         <description>Headers and startup code for Atmel ATSAM3S2A</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s2a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s2a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S2C">
         <description>Headers and startup code for Atmel ATSAM3S2C</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s2c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s2c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S2B">
         <description>Headers and startup code for Atmel ATSAM3S2B</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s2b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s2b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S4C">
         <description>Headers and startup code for Atmel ATSAM3S4C</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s4c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S4B">
         <description>Headers and startup code for Atmel ATSAM3S4B</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s4b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s4b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S4A">
         <description>Headers and startup code for Atmel ATSAM3S4A</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s4a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s4a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S1A">
         <description>Headers and startup code for Atmel ATSAM3S1A</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s1a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s1a_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S1B">
         <description>Headers and startup code for Atmel ATSAM3S1B</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s1b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s1b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
