saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Atmel.SAM3S_DFP.1.0.70.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S1C">
         <description>Headers and startup code for Atmel ATSAM3S1C</description>
         <files>
            <file condition="C" category="include" name="sam3s/include"/>
            <file condition="C" category="header" name="sam3s/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3s/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3s/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/system_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3s/gcc/gcc/startup_sam3s.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3s/gcc/gcc/sam3s1c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s1c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3s/gcc/gcc/sam3s_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/ARM/startup_SAM3S.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3s/armcc/Device/SAM3S/Source/system_SAM3S.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S8C">
         <description>Headers and startup code for Atmel ATSAM3S8C</description>
         <files>
            <file condition="C" category="include" name="sam3sd8/include"/>
            <file condition="C" category="header" name="sam3sd8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/system_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/gcc/startup_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3sd8/gcc/gcc/sam3s8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3s8c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/ARM/startup_SAM3SD8.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/system_SAM3SD8.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3S8B">
         <description>Headers and startup code for Atmel ATSAM3S8B</description>
         <files>
            <file condition="C" category="include" name="sam3sd8/include"/>
            <file condition="C" category="header" name="sam3sd8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/system_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/gcc/startup_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3sd8/gcc/gcc/sam3s8b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3s8b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/ARM/startup_SAM3SD8.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/system_SAM3SD8.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3SD8B">
         <description>Headers and startup code for Atmel ATSAM3SD8B</description>
         <files>
            <file condition="C" category="include" name="sam3sd8/include"/>
            <file condition="C" category="header" name="sam3sd8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/system_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/gcc/startup_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3sd8/gcc/gcc/sam3sd8b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8b_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/ARM/startup_SAM3SD8.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/system_SAM3SD8.c"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM3SD8C">
         <description>Headers and startup code for Atmel ATSAM3SD8C</description>
         <files>
            <file condition="C" category="include" name="sam3sd8/include"/>
            <file condition="C" category="header" name="sam3sd8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam3sd8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam3sd8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/system_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam3sd8/gcc/gcc/startup_sam3sd8.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam3sd8/gcc/gcc/sam3sd8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8c_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam3sd8/gcc/gcc/sam3sd8_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/ARM/startup_SAM3SD8.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam3sd8/armcc/Device/SAM3SD8/Source/system_SAM3SD8.c"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
